Repository: IronVenom/PyZombis
Catalog: Translated doc/*/LC_MESSAGES/TWP10.po
Languages: es

source: Condições
es: condiciones

source: “Executar ou não executar? Eis a questão...”
es: En general no ejecuto todas las líneas del programa

source: Passar pelas linhas de um programa é como andar de carro numa cidade
es: Pasar por las líneas de un programa es como caminar en una ciudad

source: Existem pontos onde decidimos qual caminho escolher
es: Hay puntos donde decidimos qué camino elegir

source: if
es: si

source: Ler dois valores inteiros e imprimir o maior deles
es: Leer dos valores enteros e imprimir el mayor de ellos

source: Dois pontos e identação
es: Dos puntos e identación

source: Verificar se um carro é novo ou velho
es: Comprobar si un coche es nuevo o viejo

source: Se o carro tiver pelo menos três anos é novo
es: Si el coche tiene al menos tres años es nuevo

source: Pergunte a velocidade de um carro, supondo um valor inteiro. Caso ultrapasse 110 km/h, exiba uma mensagem dizendo que o usuário foi multado. Neste caso, exiba o valor da multa, cobrando R$ 5,00 por km acima de 110.
es: Pregunte la velocidad de un coche, suponiendo un valor entero.sobrepasa 110 km / h, muestra un mensaje diciendo que el usuario fuemultado, en este caso, exhiba el valor de la multa, cobrando R $ 5,00 por kmencima de 110."

source: else
es: otro

source: O que fazer quando a condição do if é falsa?
es: ¿Qué hacer cuando la condición del if es falsa?

source: Os dois códigos abaixo fazem a mesma coisa:
es: Los dos códigos siguientes hacen lo mismo:

source: Estrutura aninhadas
es: Estructura anidada

source: Considere a empresa de telefonia Tchau. Abaixo de 200 minutos, a empresa cobra R$ 0,20 por minuto. Entre 200 e 400 minutos, o preço é R$ 0,18. Acima de 400 minutos o preço por minuto é R$ 0,15. Calcule sua conta de telefone.
es: "Considere la empresa de telefonía Tchau. Debajo de 200 minutos, la empresacobra R $ 0,20 por minuto, entre 200 y 400 minutos, el precio es de 0,18.Por encima de 400 minutos el precio por minuto es de 0,15. Calcule su cuenta deTeléfono".

source: Estruturas aninhadas
es: Estructuras anidadas

source: Modifique o programa da empresa Tchau para uma promoção onde a tarifa é de R$ 0,08 quando você utiliza mais que 800 minutos
es: "Modifique el programa de la empresa Tchau para una promoción donde la tarifa esde R $ 0,08 cuando se utiliza más de 800 minutos"

source: A cláusula elif substitui um par else if
es: La cláusula elif reemplaza un par else if

source: Lista de Exercícios “again”
es: Lista de ejercicios "de nuevo
