Repository: IronVenom/PyZombis
Catalog: locale/*/LC_MESSAGES/TWP05.po
Languages: es

source: Variáveis e Entrada de Dados
es: Variables y entrada de datos

source: Primeiro programa
es: Primer programa

source: Este programa possui apenas uma linha de código
es: Este programa tiene una sola línea de código.

source: Observe que as aspas não aparecem na saída
es: Tenga en cuenta que las comillas no aparecen en la salida

source: Precisamos marcar ou limitar o início e o fim de nossas mensagens com um símbolo, nesse caso, as aspas
es: Necesitamos marcar o limitar el comienzo y el final de nuestros mensajes con unasímbolo, en este caso, las comillas

source: Primeira mensagem de erro
es: Primer mensaje de error

source: Letras maiúsculas e minúsculas são diferentes
es: Las letras mayúsculas y minúsculas son diferentes

source: Você reparou que Print não está na cor roxa?
es: ¿Notaste que la impresión no está en el color púrpura?

source: Se não utilizarmos aspas, o computador interpretará nossa mensagem como um comando da linguagem Python, gerando um erro de sintaxe
es: Si no usamos comillas, la computadora interpretará nuestro mensaje comoun comando de lenguaje Python, generando un error de sintaxis

source: Você reparou que a mensagem não está na cor verde?
es: ¿Notaste que el mensaje no es verde?

source: Na versão do Python que usamos os parênteses não são opcionais no print
es: En la versión de Python usamos los paréntesis no son opcionales en la impresión

source: Os espaços iniciais possuem um significado em Python que veremos mais adiante
es: Los espacios iniciales tienen un significado en Python que veremos másadelante

source: O interpretador é um programa que aceita comandos escritos em Python e os executa, linha a linha
es: El intérprete es un programa que acepta comandos escritos en Python y elrealizar, línea por línea

source: Sem o interpretador, nossos programas não podem ser executados, sendo considerados apenas um texto
es: Sin el intérprete, nuestros programas no pueden ser ejecutados, siendoconsiderado solo texto

source: O interpretador verifica se escrevemos corretamente o programa, mostrando mensagens de erro caso haja algum problema
es: El intérprete verifica si escribimos el programa correctamente, mostrandomensajes de error si hay un problema

source: Existem dois modos do interpretador Python: modo interativo e modo de edição
es: Hay dos modos del intérprete de Python: modo interactivo yeditando

source: Usamos nos exemplos anteriores o modo interativo
es: Usamos en los ejemplos anteriores el modo interactivo.

source: Uma vantagem do modo interativo é poder testar comandos e obter a resposta instantaneamente
es: Una ventaja del modo interactivo es que puede probar comandos y obtener elrespuesta al instante

source: Modo edição
es: Modo de edición

source: Rodar o programa
es: Ejecuta el programa

source: Salvar o programa
es: Guardar el programa

source: Mesmo resultado!
es: Mismo resultado

source: Cuidados ao digitar programas
es: Cuidado al escribir programas

source: Aspas são muito importantes e não devem ser esquecidas. Todas vez que você abrir aspas, não esqueça de fechá-las
es: Las comillas son muy importantes y no deben ser olvidadas. Cada vezUsted abre comillas, no olvide cerrarlas

source: Parênteses não são opcionais em Python. Todo parênteses aberto deve ser fechado.
es: Los paréntesis no son opcionales en Python. Todos los paréntesis abiertos deben sercerrado.

source: Espaços são muito importantes. A linguagem Python se baseia na quantidade de espaços em branco antes do início de cada linha para realizar diferentes operações.
es: Los espacios son muy importantes. El lenguaje de Python se basa en la cantidadespacios en blanco antes del comienzo de cada línea para realizarDiferentes operaciones.

source: Calculadora no interpretador
es: Calculadora en intérprete

source: Conceitos de variáveis e atribuição
es: Conceptos de variación y asignación.

source: Variáveis são utilizadas para armazenar valores e para dar nome a uma área da memória do computador
es: Las variables se utilizan para almacenar valores y para nombrar aárea de memoria de la computadora

source: O símbolo para atribuição é o igual (=)
es: El símbolo para la asignación es el igual (=)

source: Como em matemática, passamos parâmetros ou valores para uma função usando parênteses
es: Como en matemáticas, pasamos parámetros o valores a una función usandoparéntesis

source: Função f(x), onde f é o nome da função e x um parâmetro
es: Función f (x), donde f es el nombre de la función y x un parámetro

source: No exemplo anterior print é o nome da função e a + b, o valor passado como parâmetro
es: En el ejemplo anterior, imprimir es el nombre de la función y a + b el valor pasadocomo parámetro

source: Podemos usar o modo interativo também
es: Podemos usar el modo interactivo también

source: As duas primeiras linhas não enviam nada para a tela, por isso, apenas o resultado da terceira linha é mostrado
es: Las dos primeras líneas no envían nada a la pantalla, así que solo laSe muestra el resultado de la tercera línea

source: Você pode estar se perguntando por que criamos duas variáveis, a e b, para somar dois números?
es: Puede que te preguntes por qué creamos dos variables, aybpara sumar dos números?

source: Poderíamos ter obtido o mesmo resultado de diversas formas
es: Podríamos haber obtenido el mismo resultado de varias maneras.

source: Qual é a diferença entre o primeiro modo e os dois últimos?
es: ¿Cuál es la diferencia entre el primer modo y los dos últimos?

source: No primeiro caso está incluído a lógica que usamos para obter o resultado
es: En el primer caso se incluye la lógica que utilizamos para obtener el resultado.

source: Deixamos assim explícito o algoritmo que usamos mentalmente para resolver esse problema
es: Así dejamos explícito el algoritmo que usamos mentalmente para resolvereste problema

source: Nos dois últimos casos apenas ordenamos que o computador imprima algo concreto, sem deixar claro a lógica para chegar naquele resultado
es: En los últimos dos casos, le pedimos a la computadora que imprima algoConcreto, sin dejar clara la lógica para llegar a ese resultado

source: 1.Seu salário atual é de R$ 6500 reais. Faça um programa que calcule o novo salário com um aumento de 5%
es: 1.Su salario actual es de R $ 6500. Haga un programa que calcule elNuevo salario con un aumento del 5%

source: 2.Escreva um programa que exiba seu nome na tela
es: 2. Escriba un programa que muestre su nombre en la pantalla.

source: 3.Calcule a soma de três variáveis
es: 3.Calcular la suma de tres variables

source: 4.O que acontece se eu colocar textos nas três variáveis anteriores?
es: 4. ¿Qué sucede si pongo texto en las tres variables anteriores?

source: Nomes de variáveis
es: Nombres de variables

source: Em Python, nomes de variáveis devem iniciar obrigatoriamente com uma letra ou caracter sublinhado (_)
es: En Python, los nombres de las variables deben comenzar con unaletra o carácter subrayado (_)

source: Acentos são permitidos!
es: Se permiten los acentos!

source: Exemplo de nomes válidos: preço, ação, salário, _x, ano_2011, salário_médio
es: Ejemplo de nombres válidos: precio, acción, salario, _x, año_2011,salarial_médio

source: Exemplo de nomes inválidos: salário médio, 3x, 1ª, @, $
es: Ejemplo de nombres inválidos: salario promedio, 3x, 1st, @, $

source: Tipos de variáveis
es: Tipos de variables

source: O conteúdo de uma variável possui um tipo
es: Los contenidos de una variable tienen un tipo de

source: O tipo define a natureza dos dados que a variável armazena
es: El tipo define la naturaleza de los datos que almacena la variable

source: Os tipos mais comuns são inteiros, números em ponto flutuante e strings (texto)
es: Los tipos más comunes son enteros, números de punto flotante y cadenas(texto)

source: Além de poder armazenar números e letras, as variáveis em Python também armazenam valores como True e False
es: Además de almacenar números y letras, las variables en Python tambiénalmacenar valores como verdaderos y falsos

source: Variáveis numéricas
es: Variables numericas

source: Inteiros não possuem casas decimais: 42, -7
es: Los enteros no tienen decimales: 42, -7

source: O tipo inteiro em Python é chamado int
es: El tipo entero en Python se llama int

source: Números em ponto flutuante possuem casa decimal: 1.0, 3.1415, 1234.56
es: Los números de punto flotante tienen posiciones decimales: 1.0, 3.1415, 1234.56

source: Note que 1.0, mesmo tendo zero na parte decimal, é um número em ponto flutuante
es: Tenga en cuenta que 1.0, incluso teniendo cero en la parte decimal, es un número de puntoflotando

source: O tipo ponto flutuante em Python é chamado float
es: El tipo de punto flotante en Python se llama float

source: Exercícios
es: Ejercicios

source: 5.Indique o tipo dos seguintes valores: 5, 5.0, 4.3, -2, 100, 1.333, “10”
es: 5. Ingrese el tipo de los siguientes valores: 5, 5.0, 4.3, -2, 100, 1,333, 10

source: 6.Experimente digitar type(x) onde x é cada um dos valores acima no Python interativo
es: 6.Trate de escribir el tipo (x) donde x es cada uno de los valores anteriores en elPython interactivo

source: 7.É possível calcular 2 elevado a um milhão?
es: 7. ¿Es posible calcular 2 de alto a un millón?

source: Representação de valores numéricos
es: Representación de valores numéricos.

source: Internamente todos os números são representados no sistema binário
es: Internamente todos los números están representados en el sistema binario.

source: Esse sistema permite apenas os dígitos 0 e 1
es: Este sistema solo permite dígitos 0 y 1.

source: Números em ponto flutuante podem não ter representação exata no sistema binário
es: Los números de punto flotante pueden no tener una representación exacta en el sistemabinario

source: Ex.: Digitando no interpretador 3*0.1 teremos como resposta 0.30000000000000004
es: Ej.: Escribiendo en el intérprete 3 * 0.1 tendremos como respuesta0.30000000000000004

source: Variáveis do tipo lógico
es: Variables de tipo lógico

source: Podemos armazenar verdadeiro e falso
es: Podemos almacenar lo verdadero y lo falso.

source: A variável se chama lógica ou booleana
es: La variable se llama lógica o booleana.

source: Em Python escrevemos True e False
es: En Python escribimos Verdadero y Falso.

source: Observe que T e F são escritos em maiúsculas
es: Tenga en cuenta que T y F están escritos en mayúsculas

source: Operadores relacionais
es: Operadores relacionales

source: **Operadores relacionais**
es: **Operadores relacionales**

source: Operação
es: Operación

source: Símbolo matemático
es: Simbolo matematico

source: maior que
es: más grande que

source: menor que
es: menos que

source: maior ou igual
es: mayor o igual

source: menor ou igual
es: menor o igual que

source: Exemplos:
es: Ejemplos:

source: Exemplo importante
es: Ejemplo importante

source: >= ou <= para valores iguais
es: > = o <= para valores iguales

source: Exemplo
es: Ejemplo

source: Podemos usar operadores relacionais para inicializar variáveis do tipo lógico
es: Podemos usar operadores relacionales para inicializar variables de tipológico

source: Operadores Lógicos
es: Operadores logicos

source: Temos três operadores básicos: not, and e or
es: Tenemos tres operadores básicos: no, y y o

source: Operador not
es: Operador no

source: Operador and
es: Operador y

source: Operador or
es: Operador o

source: Expressões Lógicas
es: Expresiones logicas

source: Podemos combinar os operadores lógicos em expressões lógicas
es: Podemos combinar operadores lógicos en expresiones lógicas.

source: A ordem de avaliação é not > and > or
es: El orden de evaluación no es> y> o

source: A condição para empréstimo de compra de uma moto é salário maior que R$ 1.000,00 e idade acima de 18 anos. Verificar se o José pode pegar o empréstimo
es: La condición para el préstamo de compra de una motocicleta es un salario superior a R $1,000.00 y edad mayor de 18. Verifique que José pueda recoger elpréstamo

source: Verifique se um aluno que tirou média para exercícios programa 5.8 e média de provas 7 passou
es: Asegúrese de que un estudiante que ha promediado los ejercicios del programa para 5.8 yel promedio de la prueba 7 ha pasado

source: Variáveis String
es: Variables de cadena

source: Armazenam cadeias de caracteres como nomes e textos em geral
es: Almacenar cadenas como nombres y textos generales.

source: Chamamos cadeias de caracteres uma sequência de símbolos como letras, números, sinais de pontuação, etc
es: Llamamos a las cadenas una secuencia de símbolos como letrasNúmeros, signos de puntuación, etc.

source: Para diferenciar seus comandos de uma string utilizamos aspas no início e no final
es: Para distinguir sus comandos de una cadena usamos comillas al principio y al final

source: Note que não há problema de utilizarmos espaços para separar as palavras
es: Tenga en cuenta que está bien usar espacios para separar palabras.

source: Uma string tem um tamanho associado
es: Una cadena tiene una longitud asociada

source: Podemos obter o tamanho através da função embutida len
es: Podemos obtener el tamaño a través de la función incorporada len

source: Podemos acessar os caracteres da string utilizando um número inteiro para representar sua posição
es: Podemos acceder a los caracteres de cadena usando un entero pararepresenta tu posición

source: Este número é chamado de índice e começamos a contar de zero
es: Este número se llama índice y comenzamos a contar desde cero.

source: Acessamos o caracter fornecendo o índice entre colchetes ([ ])
es: Accedemos al personaje proporcionando el índice entre corchetes ([])

source: Cuidado: não podemos acessar um índice maior que a quantidade de caracteres da string
es: Precaución: no podemos acceder a un índice mayor que la cantidad decaracteres de cadena

source: Operações com strings
es: Operaciones de cadena

source: As operações básicas são fatiamento, concatenação e composição
es: Las operaciones básicas son corte, concatenación y composición.

source: O fatiamento permite utilizar parte da string e a concatenação nada mais é do que juntar duas ou mais strings
es: El corte le permite usar parte de la cadena y la concatenación nada másEs que unir dos o más cuerdas

source: A composição é muito utilizada em mensagens que enviamos para a tela e consiste em utilizar strings como modelos onde podemos inserir dados
es: La composición se usa mucho en los mensajes que enviamos a la pantalla yconsiste en usar cadenas como plantillas donde podemos insertar datos

source: Concatenação
es: Concatenacion

source: Composição
es: Composicion

source: Juntar várias strings nem sempre é prático
es: Unir múltiples cadenas no siempre es práctico

source: Podemos usar marcadores para substituir valores dentro de strings
es: Podemos usar marcadores para reemplazar valores dentro de cadenas

source: Os principais marcadores são %d para números inteiros, %s para strings e %f para números em ponto flutuante
es: Los marcadores superiores son %d para enteros,%s para cadenas y%f para números de punto flotante

source: %03d completa com zeros adicionais
es: %03d completo con ceros adicionales

source: %3d significa três posições sem zeros adicionais
es: % 3d significa tres posiciones sin ceros adicionales

source: %5.2f significa 5 caracteres no total e 2 casas decimais
es: % 5.2f significa 5 caracteres en total y 2 decimales

source: Fatiamento
es: Rebanada

source: Fatia do primeiro índice até o anterior do segundo
es: Rebanada del primer índice al anterior del segundo.

source: Podemos omitir índices, substituindo pelo extremo correspondente e também podemos ter índices negativos: -1 último, -2 penúltimo
es: Podemos omitir índices, sustituyendo el extremo correspondiente y tambiénPodemos tener índices negativos: -1 último, -2 penúltimo

source: Alteração de variáveis com o tempo
es: Cambio de variables a lo largo del tiempo.

source: Um programa é executado linha por linha
es: Un programa corre línea por línea.

source: Assim, as variáveis podem mudar com o tempo de execução do seu programa
es: Entonces, las variables pueden cambiar con el tiempo de ejecución de su programa

source: Teste de mesa ou simulação
es: Prueba de mesa o simulación

source: Entender que o valor das variáveis pode mudar durante a execução de um programa não é tão natural, mas é fundamental para a programação
es: Comprender que el valor de las variables puede cambiar al ejecutar unEl programa no es tan natural, pero es fundamental para la programación

source: Um programa não pode ser lido como um texto, mas cuidadosamente analisado linha a linha
es: Un programa no puede ser leído como un texto, sino analizado cuidadosamentelínea por línea

source: Você pode treinar com lápis, borracha e papel
es: Puedes entrenar con lápiz, borrador y papel.

source: **Teste de mesa ou simulação**
es: **Prueba de mesa o simulación**

source: dívida
es: deuda

source: Tela
es: Pantalla

source: Não tenha pressa para o teste de mesa
es: No se apresure a la prueba de mesa

source: Entrada de Dados
es: Entrada de datos

source: Até agora nossos programas trabalharam com valores conhecidos
es: Hasta ahora nuestros programas han trabajado con valores conocidos.

source: Vamos começar a pegar os valores durante a execução dos programas e usar mais o modo de edição
es: Comencemos a recoger los valores mientras ejecutamos programas y los usamosmás el modo de edición

source: Conversão da entrada de dados
es: Conversión de entrada de datos

source: A função input retorna apenas strings
es: La función de entrada solo devuelve cadenas

source: Usamos int( ) para converter um valor para inteiro e float( ) para ponto flutuante
es: Usamos int () para convertir un valor a entero y float () a puntoflotando

source: Erro comum
es: Error comun

source: Esquecer algum parênteses. O erro vai dar na linha de baixo.
es: Olvida algunos paréntesis. El error llegará a la línea de fondo.

source: Lista de Exercícios
es: Lista de ejercicios
