Repository: IronVenom/PyZombis
Catalog: locale/*/LC_MESSAGES/TWP15.po
Languages: es

source: Repetições
es: Repeticiones

source: Imprimindo de 1 a 3
es: Imprimiendo de 1 a 3

source: Forma simples
es: Forma simple

source: Usando uma variável
es: Utilizando una variable

source: Incrementando a variável
es: Aumentando la variable

source: Usando while
es: Usando mientras

source: Teste de mesa
es: Prueba de mesa

source: Agora imprima de 1 até um número digitado pelo usuário
es: Ahora imprime desde 1 a un número ingresado por el usuario

source: Imprimir os números pares entre 0 e um número fornecido usando if
es: Imprima los números pares entre 0 y un número provisto usando if

source: Imprimir os números pares entre 0 e um número fornecido sem utilizar o if
es: Imprima números pares entre 0 y un número dado sin usar si

source: Modifique o programa anterior para imprimir de 1 até o número digitado pelo usuário, mas dessa vez apenas os números ímpares
es: Modificar el programa anterior para imprimir desde 1 hasta el número ingresadopor el usuario, pero esta vez solo los números impares

source: Reescreva o programa anterior para escrever os 10 primeiros múltiplos de 3
es: Reescribe el programa anterior para escribir los primeros 10 múltiplos de 3.

source: A diferença entre um contador e um acumulador é que nos contadores o valor adicionado é constante e, nos acumuladores, variável
es: La diferencia entre un metro y un acumulador es que en los contadores elEl valor agregado es constante y, en acumuladores, variable

source: Cálculo da soma de dez números inteiros
es: Cálculo de la suma de diez enteros.

source: Calcule a média de 10 números inteiros
es: Calcula el promedio de 10 enteros.

source: Calcule o fatorial de dez
es: Calcula el factorial de diez.

source: Calcule o fatorial de um número inteiro n
es: Calcular el factorial de un entero n

source: Interrompendo a repetição
es: Detener la repetición

source: Calcule a soma de números inteiros até ser digitado zero
es: Calcula la suma de enteros hasta que ingreses cero

source: Calcule a média de números até ser digitado zero
es: Calcula el número promedio hasta que ingreses cero

source: Repetições aninhadas
es: Repeticiones anidadas

source: Imprima as tabuadas de 1 a 10
es: Imprime las tablas del 1 al 10.

source: Lista de Exercícios “again”
es: Lista de ejercicios de nuevo

source: “A vida é como andar de bicicleta. Para manter o equilíbrio, é preciso se manter em movimento”. - Einstein.
es: La vida es como andar en bicicleta. Para mantener el equilibrio, debes estarSigue moviéndote. - Einstein.
