Repository: IronVenom/PyZombis
Catalog: locale/*/LC_MESSAGES/TWP17.po
Languages: es

source: Edifício
es: Construcción

source: Edifício de apartamentos
es: Edificio de apartamentos

source: Podemos associar o térreo ao andar zero, o primeiro é o andar 1 e assim por diante
es: Podemos asociar la planta baja con el piso cero, el primero es el piso 1 y asíen adelante

source: Trem de dados
es: Tren de datos

source: O trem de dados my_array é uma única variável
es: El tren de datos my_array es una sola variable.

source: Posso engatar vagões
es: Puedo comprometer carros

source: Como posso acrescentar um vagão com "Bettys"?
es: ¿Cómo puedo agregar un vagón con \Bettys\?

source: Posso engatar vagões com append
es: ¿Puedo enganchar vagones con anexar?

source: Uma lista vazia
es: Una lista vacía

source: Uma lista com três notas
es: Una lista con tres notas.

source: Acessando uma nota
es: Accediendo a una nota

source: Mudando a primeira nota
es: Cambiando la primera nota

source: Calcule a média de 5 notas
es: Calcula el promedio de 5 notas.

source: Obs : x+=1 é o mesmo que x = x + 1
es: Obs: x + = 1 es lo mismo que x = x + 1

source: Faça um programa que leia um vetor de 5 números inteiros e mostre o vetor
es: Haga un programa que lea un vector de 5 enteros y muestre el vector

source: Faça um programa que leia um vetor de dez números reais e mostre-os na ordem inversa
es: Haz un programa que lea un vector de diez números reales y los muestre en elorden inverso

source: Faça um programa que leia quatro notas, mostre as notas e a média na tela
es: Haga un programa que lea cuatro notas, muestre notas y promedie en la pantalla.

source: Outra forma de fazer o mesmo
es: Otra forma de hacer lo mismo.

source: Faça um Programa que leia um vetor de 10 caracteres minúsculos, e diga quantas consoantes foram lidas.
es: Haz un programa que lea un vector de 10 caracteres pequeños, y diCuántas consonantes se han leído

source: Lista de Exercícios “again”
es: Lista de ejercicios de nuevo

source: “A vida é como andar de bicicleta. Para manter o equilíbrio, é preciso se manter em movimento”. - Einstein.
es: La vida es como andar en bicicleta. Para mantener el equilibrio, debes estarSigue moviéndote. - Einstein.
