Repository: IronVenom/PyZombis
Catalog: locale/*/LC_MESSAGES/TWP18.po
Languages: es

source: Strings
es: Cuerdas

source: Aspas de vários tipos
es: Las comillas de varios tipos

source: Posso usar aspas simples, duplas ou triplas
es: ¿Puedo usar comillas simples, dobles o triples?

source: Fatiamento
es: Rebanada

source: Fatia do primeiro índice até o anterior do segundo
es: Rebanada del primer índice al anterior del segundo.

source: Podemos omitir índices, substituindo pelo extremo correspondente e também podemos ter índices negativos: -1 último, -2 penúltimo
es: Podemos omitir índices, sustituyendo el extremo correspondiente y tambiénPodemos tener índices negativos: -1 último, -2 penúltimo

source: Incremento no fatiamento
es: Incremento en rebanar

source: Posso usar um incremento ao fatiar a string
es: ¿Puedo usar un incremento al cortar la cadena?

source: Verifique se uma palavra é palíndrome
es: Comprobar si una palabra es palindrome.

source: Strings são imutáveis
es: Las cuerdas son inmutables

source: Posso criar novas strings
es: ¿Puedo crear nuevas cadenas?

source: Usando concatenação resolvemos esse problema
es: Usando la concatenación resolvemos este problema.

source: Concatenação
es: Concatenacion

source: Faça um programa que leia uma palavra e troque as vogais por “*”
es: Haz un programa que lea una palabra e intercambie las vocales por

source: Verificação parcial de strings
es: Verificación parcial de cuerdas

source: Exercício
es: Ejercicio

source: Faça um programa que solicite a data de nascimento (dd/mm/aaaa) e imprima com o nome do mês por extenso
es: Haga un programa que solicite la fecha de nacimiento (dd / mm / aaaa) e imprimacon el nombre completo del mes

source: Desenvolvimento guiado por testes
es: Desarrollo guiado por pruebas

source: Passos de bebê
es: Pasos de bebe
