Repository: IronVenom/PyZombis
Catalog: locale/*/LC_MESSAGES/TWP10.po
Languages: es

source: Condições
es: Condiciones

source: Seus programas nem sempre serão seqüências simples de comandos
es: Tus programas no siempre serán simples secuencias de comandos.

source: “Executar ou não executar? Eis a questão...”
es: “Ejecutar o no correr? Esa es la cuestión...”

source: Em geral não executo todas as linhas do programa
es: Generalmente no ejecuto todas las líneas de programa.

source: Passar pelas linhas de um programa é como andar de carro numa cidade
es: Pasar por las líneas de un programa es como conducir en una ciudad

source: Existem pontos onde decidimos qual caminho escolher
es: Hay puntos en los que decidimos qué camino elegir.

source: Ler dois valores inteiros e imprimir o maior deles
es: Lee dos valores enteros e imprime el mayor de ellos.

source: Dois pontos e identação
es: Dos puntos y sangría

source: Verificar se um carro é novo ou velho
es: Compruebe si un coche es nuevo o viejo

source: Se o carro tiver pelo menos três anos é novo
es: Si el coche tiene al menos tres años es nuevo.

source: Pergunte a velocidade de um carro, supondo um valor inteiro. Caso ultrapasse 110 km/h, exiba uma mensagem dizendo que o usuário foi multado. Neste caso, exiba o valor da multa, cobrando R$ 5,00 por km acima de 110.
es: Pregunte la velocidad de un automóvil, asumiendo un valor entero. Casoexcede los 110 km / h, muestra un mensaje que dice que el usuario fuemultado En este caso, visualice el importe de la multa, cobrando R $ 5,00 por km.por encima de 110.

source: O que fazer quando a condição do if é falsa?
es: ¿Qué hacer cuando la condición if es falsa?

source: Os dois códigos abaixo fazem a mesma coisa:
es: Los dos códigos siguientes hacen lo mismo:

source: Estrutura aninhadas
es: Estructura anidada

source: Considere a empresa de telefonia Tchau. Abaixo de 200 minutos, a empresa cobra R$ 0,20 por minuto. Entre 200 e 400 minutos, o preço é R$ 0,18. Acima de 400 minutos o preço por minuto é R$ 0,15. Calcule sua conta de telefone.
es: Considere la compañía de teléfonos Bye. Por debajo de los 200 minutos, la compañíacobra $ 0.20 por minuto, entre 200 y 400 minutos, el precio es $ 0.18Por encima de los 400 minutos, el precio por minuto es de $ 0.15. Calcule su cuenta desdeteléfono

source: Estruturas aninhadas
es: Estructuras anidadas

source: Modifique o programa da empresa Tchau para uma promoção onde a tarifa é de R$ 0,08 quando você utiliza mais que 800 minutos
es: Modificar el programa de la empresa Adiós a una promoción donde está la tarifapor $ 0.08 cuando usas más de 800 minutos

source: A cláusula elif substitui um par else if
es: La cláusula elif anula un otro si

source: Lista de Exercícios “again”
es: Lista de ejercicios de nuevo

source: “A vida é como andar de bicicleta. Para manter o equilíbrio, é preciso se manter em movimento”. - Einstein.
es: La vida es como andar en bicicleta. Para mantener el equilibrio, debes estarSigue moviéndote. - Einstein.
