Repository: IronVenom/PyZombis
Catalog: locale/*/LC_MESSAGES/TWP20.po
Languages: es

source: For Funções e Random
es: Para Funciones y Aleatorio.

source: for == while enrustido
es: for == while apretado

source: Códigos equivalentes : for durante o dia vira while á noite.
es: Códigos equivalentes: durante el día girar mientras que por la noche.

source: Aprendemos algumas funções do Python: len, int, float, print e input
es: Aprendimos algunas funciones de Python: len, int, float, print y input

source: Agora iremos criar as nossas próprias funções
es: Ahora vamos a crear nuestras propias funciones.

source: Utilizo def para definir a função e return para devolver algum valor
es: Utilizo def para configurar la función y regresar para devolver algún valor

source: Existem funções que não retornam nada
es: Hay funciones que no devuelven nada.

source: Esta função retorna se o parâmetro x é par
es: Esta función regresa si el parámetro x es par

source: Observe que diferentemente do que já vimos até agora, essas linhas não serão executadas imediatamente
es: Tenga en cuenta que a diferencia de lo que hemos visto hasta ahora, estas líneas no lo hacenserá ejecutado inmediatamente

source: Preciso chamar a função para executá-la
es: Necesito llamar a la función para ejecutarla.

source: Funções
es: Funciones

source: Defina uma função fatorial
es: Definir una función factorial.

source: Variáveis locais e globais
es: Variables locales y globales

source: Nesse caso, usamos a palavra-chave global. Então, a variável 'a' dentro da função é a mesma que a variável definida acima, ou seja, é a variável global.
es: En este caso, usamos la palabra clave global, por lo que la variable 'a' enLa función es la misma que la variable definida anteriormente, es decir, es la variableglobal

source: Observe a diferença nas saídas dos Exemplos 9 e 10.
es: Note la diferencia en las salidas de los Ejemplos 9 y 10.

source: Números aleatórios
es: Números aleatorios

source: Defina uma função “embaralha” que retorne as letras de uma string misturadas. Dica: utilize list( ) para converter sua string em lista.
es: Establecer una función aleatoria que devuelve las letras de una cadenaUsa list () para convertir tu cadena a la lista

source: Gere uma lista de 15 inteiros aleatórios entre 10 e 100
es: Genera una lista de 15 enteros aleatorios entre 10 y 100

source: Gere uma lista de 15 inteiros aleatórios entre 10 e 100 que sejam distintos entre si
es: Generar una lista de 15 enteros aleatorios entre 10 y 100 que sondiferente el uno del otro

source: “A vida é como andar de bicicleta. Para manter o equilíbrio, é preciso se manter em movimento”. - Einstein.
es: La vida es como andar en bicicleta. Para mantener el equilibrio, debes estarSigue moviéndote. - Einstein.
