Repository: IronVenom/PyZombis
Catalog: locale/*/LC_MESSAGES/TWP25.po
Languages: es

source: Classes e Objetos
es: Clases y objetos

source: Baixar os códigos abaixo
es: Descarga los códigos a continuación

source: Classes e objetos
es: Clases y objetos

source: Classes associam dados (atributos) e operações (métodos) em uma só estrutura
es: Las clases asocian datos (atributos) y operaciones (métodos) en unoestructura

source: Um objeto é uma variável cujo tipo é uma classe, ou seja, um objeto é uma instância de uma classe
es: Un objeto es una variable cuyo tipo es una clase, es decir, un objeto es unainstancia de una clase

source: Veremos apenas o básico da orientação à objetos
es: Solo veremos los fundamentos de la orientación a objetos.

source: Quando declaramos uma classe, estamos criando um novo tipo de dados
es: Cuando declaramos una clase, estamos creando un nuevo tipo de datos

source: Da mesma forma que quando criamos uma lista ou uma string, estamos instanciando ou criando uma instância dessas classes
es: Al igual que cuando creamos una lista o una cadena, somosinstanciar o crear una instancia de estas clases

source: É a mesma coisa fazer lista = [] ou lista = list()
es: Es lo mismo que hacer list = [] o list = list ()

source: O método __init__ é chamado construtor e é chamado na criação do objeto
es: El método __init__ se llama constructor y se llama en la creación de objetos

source: O parâmetro self significa o objeto televisão em si
es: El auto parámetro significa el objeto de televisión en sí.

source: self.ligada é um valor de self, ou seja, do objeto televisão
es: el yo es un valor del yo, es decir, del objeto de televisión

source: Sempre que criamos atributos do objeto, devemos associá-los a self.
es: Siempre que creamos atributos del objeto, debemos asociarlos con uno mismo.

source: Você irá informatizar o banco Tatú, controlando o saldo das contas correntes
es: Se informatizará al banco Tatú, controlando el saldo de las cuentascadenas

source: Cada conta corrente pode ter um ou mais clientes como titular
es: Cada cuenta corriente puede tener uno o más clientes como titular.

source: O banco controla apenas o nome e telefone
es: El banco solo controla el nombre y el teléfono.

source: A conta corrente apresenta um saldo e um extrato de operações de saques e depósitos
es: La cuenta corriente presenta un saldo y un estado de retiros ydepósitos

source: Não há contas especiais, logo o cliente não pode sacar mais do que têm no saldo
es: No hay cuentas especiales, por lo que el cliente no puede retirar más de lo que tiene en elbalance

source: Arquivo tatu.py
es: Archivo tatu.py

source: Arquivo teste.py, Saída de teste
es: Archivo Test.py, salida de prueba

source: Extrato de operações
es: Declaración de operaciones

source: Altere o método resumo da classe Conta para extrato, imprimindo agora uma lista de operações de saques e depósitos feitas
es: Cambie el método de resumen de la clase de Cuenta para extraer, ahora imprimiendo unListado de retiros y depósitos realizados

source: Altere o método __init__ para que utilize o método depósito para inicializar o saldo
es: Cambie el método __init__ para usar el método de archivo ainicializar el balance

source: Arquivo tatu2.py (apenas Conta)
es: Archivo tatu2.py (solo cuenta)

source: Arquivo teste2.py, Saída de teste2
es: Archivo test2.py, salida Test2

source: Herança
es: Herencia

source: A orientação a objetos permite modificar nossas classes, adicionando ou modificando atributos e métodos, tendo como base a classe anterior
es: La orientación a objetos le permite modificar nuestras clases agregando oModificación de atributos y métodos, basados ​​en la clase anterior

source: Vamos criar contas especiais, onde podemos sacar mais dinheiro que o saldo, até um determinado limite
es: Vamos a crear cuentas especiales, donde podamos obtener más dinero que elsaldo, hasta cierto límite

source: As operações depósito, extrato e resumo continuam como uma conta normal
es: Las operaciones de depósito, extracción y resumen continúan como una cuenta normal

source: Adicionar ContaEspecial tatu3.py
es: Añadir cuenta especial tatu3.py

source: ContaEspecial
es: Cuenta Especial

source: Observe que escrevemos Conta entre parênteses
es: Tenga en cuenta que escribimos Cuenta entre paréntesis

source: ContaEspecial herda os métodos e atributos de Conta
es: La cuenta especial hereda los métodos y atributos de la cuenta.

source: self.limite será criado apenas para classes do tipo ContaEspecial
es: self.limite se creará solo para clases de tipo de cuenta especial

source: Observe que estamos substituindo completamente o método saque em ContaEspecial
es: Tenga en cuenta que estamos reemplazando completamente el método de extracción enCuenta Especial

source: Arquivo teste3.py, Saída teste 3
es: Test3.py archivo, prueba de salida 3

source: Vantagens da herança
es: Ventajas de la herencia.

source: Modificamos muito pouco o nosso programa, mantendo a funcionalidade anterior e adicionando novos recursos
es: Hemos modificado muy poco nuestro programa manteniendo la funcionalidadAnterior y añadiendo nuevas funcionalidades

source: Foi possível fazer o reuso dos métodos de Conta
es: Se pudo reutilizar los métodos de la cuenta.

source: Assim a definição da classe ContaEspecial foi bem menor, incluindo apenas o comportamento diferente
es: Así que la definición de la clase SpecialCount era mucho más pequeña, incluyendo solocomportamiento diferente

source: Outro exemplo OOP
es: Otro ejemplo de OOP
