Repository: IronVenom/PyZombis
Catalog: locale/*/LC_MESSAGES/TWP23.po
Languages: es

source: Arquivos e Dicionários
es: Archivos y diccionarios

source: Arquivos
es: Archivos

source: Até agora nossos dados desapareciam ao sair do IDLE
es: Hasta ahora, nuestros datos han desaparecido al salir de IDLE.

source: Arquivos servem para armazenamento permanente
es: Los archivos son para el almacenamiento permanente.

source: Um arquivo é uma área em disco onde podemos ler ou gravar informações
es: Un archivo es un área en un disco donde puede leer o escribir información

source: Acessamos o arquivo pelo seu nome
es: Accedemos al archivo por su nombre.

source: Para acessar um arquivo é preciso abri-lo
es: Para acceder a un archivo necesitas abrirlo.

source: Ao abrir o arquivo informamos seu nome, diretório onde fica (se necessário) e que operações iremos executar: leitura e/ou escrita
es: Al abrir el archivo le informamos su nombre, directorio donde está (sirequerido) y qué operaciones realizaremos: lectura y / o escritura

source: A função que abre os arquivo é open e os modos são: r – leitura, w – escrita, a – append, b – binário, + (atualização)
es: La función que abre el archivo está abierta y los modos son: r - reading, w -escribiendo, a - anexar, b - binario, + (actualizar)

source: Os métodos para ler ou escrever são read e write
es: Los métodos para leer o escribir son leer y escribir.

source: Os arquivos devem ser fechados com close
es: Los archivos deben cerrarse con cerrar

source: Caso você execute este programa nada aparecerá na tela
es: Si ejecuta este programa no aparecerá nada en la pantalla.

source: Procure no diretório c:\Python3x o arquivo números.txt
es: Busque en el directorio c: \ Python3x el archivo numbers.txt

source: O modo w cria o arquivo se ele não existir, caso exista ele será apagado e reescrito
es: El modo w crea el archivo si no existe, si existe, se eliminaráy reescrito

source: readlines gera uma lista onde cada elemento é uma linha lida
es: readlines genera una lista donde cada elemento es una línea de lectura

source: Arquivos textos são simples e possuem um caracter de controle no final para pular linha
es: Los archivos de texto son simples y tienen un carácter de control al finalsaltar la linea

source: Se quisermos tirar esse caracter do final podemos usar print(linha.rstrip())
es: Si queremos sacar a este personaje del final podemos usarloprint (line.rstrip ())

source: O código acima faz o mesmo da forma pythônica.
es: El código anterior hace lo mismo de la forma pitónica.

source: No slide anterior vimos como programadores normais fazem a leitura
es: En la diapositiva anterior vimos cómo leen los programadores normales.

source: Python é legal, pois sempre você pode se aprofundar mais
es: Python es genial porque siempre puedes ir más profundo

source: Python é simples, mas difícil de esgotar
es: Python es simple, pero difícil de agotar

source: Leia mensagem.txt e grave cripto.txt com todas as vogais trocadas por ‘*’
es: Lea message.txt y escriba crypto.txt con todas las vocales intercambiadas por '*'

source: Páginas web são escritas em HTML (Hypertext Mark-up Language)
es: Las páginas web están escritas en HTML (lenguaje de marcado de hipertexto)

source: Tags HTML começam com < e terminam com >
es: Las etiquetas HTML comienzan con <y terminan con>

source: A página web é escrita entre <html> e </html> que é a tag de maior nível
es: La página web se escribe entre <html> y </ html> que es la etiqueta de nivel más alto

source: Normalmente inserimos código javascript
es: Solemos insertar código javascript.

source: Javascript não é um subconjunto de Java
es: Javascript no es un subconjunto de Java

source: Note o parâmetro de codifição utf-8 ; Sem ele os ascentos não sairão
es: Tenga en cuenta el parámetro de codificación utf-8; Sin ella no vendrán los ascensos.

source: O dicionário em si consiste em relacionar uma chave a um valor específico
es: El diccionario en sí consiste en relacionar una clave con un valor específico.

source: Diferentemente das listas, onde o índice é um número, dicionários utilizam suas chaves como índice
es: A diferencia de las listas, donde el índice es un número, los diccionariosUsa tus claves como un índice

source: Para adicionar novos elementos não preciso de append, basta fazer a atribuição
es: Para agregar nuevos elementos que no necesito agregar, simplemente haga loasignación

source: Se a chave já existe: o valor associado é alterado
es: Si la clave ya existe: el valor asociado cambia.

source: Se a chave não existe: a nova chave é adicionada
es: Si la clave no existe: se agrega la nueva clave.

source: Faça um programa que leia o arquivo alice.txt e conte o número de ocorrências de cada palavra no texto. Obs.: para saber os caracteres especiais use import string e utilize string.punctuation
es: Haz un programa que lea el archivo alice.txt y cuente el número deapariciones de cada palabra en el texto Nota: para conocer los caracteresespecial use la cadena de importación y use string.punctuation

source: Exercício Programa 1
es: Programa de ejercicios 1

source: “A vida é como andar de bicicleta. Para manter o equilíbrio, é preciso se manter em movimento”. - Einstein.
es: La vida es como andar en bicicleta. Para mantener el equilibrio, debes estarSigue moviéndote. - Einstein.
