Repository: IronVenom/PyZombis
Catalog: locale/*/LC_MESSAGES/TWP35.po
Languages: es

source: Revisão Funções
es: Funciones de revisión

source: Sejamos mais organizados
es: Seamos más organizados

source: Sejamos organizados
es: Estemos organizados

source: Quando os programas crescem, geralmente o código fica mais complexo
es: A medida que los programas crecen, el código generalmente se vuelve más complejo.

source: Uma forma de gerenciar essa complexidade é usar funções
es: Una forma de gestionar esta complejidad es utilizar funciones.

source: Elas permitem separar ações comuns, assim seu código fica mais fácil de ler e mais fácil de manter
es: Te permiten separar acciones comunes, por lo que tu código se vuelve más fácilleer y más fácil de mantener

source: O Starbuzz está sem grãos
es: Starbuzz es granulada

source: O diretor da Starbuzz quer uma opção para compra rápida, sem esperar abaixar o preço
es: El director de Starbuzz quiere una opción de compra rápida sin esperarbajar el precio

source: Ao rodar o programa irei perguntar se quer comprar já ou não
es: Cuando ejecuto el programa le preguntaré si quiere comprar o no.

source: Se o usuário responder sim, então irei pegar o preço atual e comprar
es: Si el usuario responde que sí, obtendré el precio actual y compraré

source: Sugestão de novo programa
es: Nueva sugerencia de programa

source: Programa feio...
es: Programa feo ...

source: Não duplique seu código...
es: No dupliques tu código ...

source: Isso leva ao excesso de código, tornando a manutenção do seu código difícil
es: Esto lleva al exceso de código, haciendo que su código se mantengadificil

source: Procure reutilizar seu código
es: Intenta reutilizar tu código

source: Definindo funções faremos reuso de código
es: Definiendo funciones reutilizaremos código.

source: Qual é a diferença?
es: ¿Cual es la diferencia?

source: Se eu tiver que mudar algo, irei alterar em apenas um lugar
es: Si tengo que cambiar algo, lo cambiaré en un solo lugar.

source: Funções
es: Funciones

source: Funções são códigos compartilháveis
es: Las funciones son códigos compartibles.

source: Defino um nome e chamo a função ao longo do programa
es: Defino un nombre y llamo a la función sobre el programa.

source: A função deve ser definida antes de você chamá-la
es: La función debe estar definida antes de que la llames.

source: Se você quiser retornar um valor para quem chamou a função deverá utilizar o comando return
es: Si desea devolver un valor para la persona que llama, debeusar comando de retorno

source: Não existem perguntas idiotas
es: No hay preguntas tontas

source: O comando return é igual ao print? Não, print exibe algo na tela, enquanto return devolve um valor para quem chamou a função.
es: ¿Es el comando de retorno lo mismo que imprimir? No, imprimir muestra algo en la pantallamientras return devuelve un valor para la persona que llama

source: Se eu não der return dentro da função, o que ela retorna? None
es: Si no vuelvo dentro de la función, ¿qué devuelve? Ninguno

source: Return sempre deve vir no final da função? Nem sempre, depende da lógica da função
es: ¿El retorno siempre debe venir al final de la función? No siempre, depende de la lógicade función

source: Uma função pode devolver mais de um valor? Sim, inclusive listas ou dicionários.
es: ¿Puede una función devolver más de un valor? Sí, incluidas las listas odiccionarios

source: Independente de linguagem
es: Independiente del idioma

source: Pares nome/valor
es: Nombre / Parejas de Valor

source: Muito adotado atualmente
es: Muy adoptado hoy

source: XML mais verbosa
es: XML más detallado

source: XML menor legibilidade
es: XML menos legibilidad
