Repository: IronVenom/PyZombis
Catalog: locale/*/LC_MESSAGES/TWP33.po
Languages: es

source: Revisão Strings
es: Revisión de cuerdas

source: É difícil comunicar-se sem palavras
es: Es difícil comunicarse sin palabras.

source: Entre os vários tipos de dados, um dos mais importantes é o texto ou string
es: Entre los diversos tipos de datos, uno de los más importantes es el texto ocuerda

source: Obs.: não é tão fácil manipular strings em algumas linguagens
es: Nota: no es tan fácil manipular cadenas en algunos idiomas.

source: Vamos procurar onde estão as informações num texto == scraping
es: Busquemos dónde está la información en un texto == raspado

source: E iremos aprender um dos conceitos mais importantes de orientação à objetos: métodos
es: Y aprenderemos uno de los conceptos más importantes de orientación aobjetos: métodos

source: Starbuzz Café
es: Café Starbuzz

source: Código Starbuzz atual
es: Código Starbuzz actual

source: O CEO quer apenas o preço
es: CEO solo quiere el precio

source: O preço está embutido no HTML
es: El precio está incrustado en HTML

source: Este é um texto HTML “bruto”, que é o formato das páginas Web
es: Este es un texto HTML sin procesar, que es el formato de las páginas web.

source: Strings são seqüências de caracteres
es: Las cuerdas son cuerdas

source: Como obter apenas o preço?
es: ¿Cómo obtener sólo el precio?

source: Fatiamento
es: Rebanada

source: Fatia do primeiro número até antes do segundo
es: Rebanada desde el primer número hasta antes del segundo.

source: Não inclui o segundo número!
es: ¡No incluye el segundo número!

source: O CEO está feliz!
es: El CEO es feliz!

source: Não existem perguntas idiotas
es: No hay preguntas tontas

source: Posso colocar qualquer página web neste código?
es: ¿Puedo poner cualquier página web en este código?

source: Sim. Fique à vontade, mas não esqueça o decode
es: Sí. Siéntete libre, pero no olvides la decodificación.

source: Por exemplo, o site abaixo usa iso8859
es: Por ejemplo, el siguiente sitio utiliza iso8859

source: `Link for the same <http://www.ime.usp.br/~pf/algoritmos/dicios/br>`_
es: `Enlace para el mismo <http://www.ime.usp.br/~pf/algoritmos/dicios/br>`_

source: O que urllib.request faz?
es: Que hace urllib.request

source: Permite conversar com a internet
es: Hablemos a internet

source: Posso acessar uma página diretamente no navegador?
es: ¿Puedo acceder a una página directamente en el navegador?

source: Sim. Digite no modo interativo “import antigravity”
es: Sí. Ingrese en modo interactivo importar antigravedad

source: Descontos para clientes fiéis
es: Descuentos para clientes leales.

source: Programa de fidelidade
es: Programa de lealtad

source: O preço se moveu
es: El precio movido

source: As páginas são diferentes e o preço muda de posição na string
es: Las páginas son diferentes y el precio cambia de posición en la cadena.

source: Os dados do Python são espertos
es: Los datos de Python son inteligentes

source: As linguagens de programação fornecem uma funcionalidade embutida nos dados para ajudá-lo
es: Los lenguajes de programación proporcionan funcionalidad incorporada endatos para ayudarte

source: Os dados do Python são espertos: eles podem fazer coisas
es: Los datos de Python son inteligentes: pueden hacer cosas

source: Método find
es: Encontrar metodo

source: Métodos find para strings
es: Encontrar metodos para cuerdas

source: Para saber os métodos que possuo dar ctrl + espaço após ponto
es: Para conocer los métodos tengo que dar ctrl + espacio tras punto

source: Só quando for menos que 4.74
es: Solo cuando menos de 4.74

source: Strings são diferentes de números
es: Las cuerdas son diferentes de los números

source: Convertendo para float
es: Convertir a flotar

source: Ele pode ficar testando o preço?
es: ¿Puede estar probando el precio?

source: Ele pode ficar tentando?
es: ¿Puede seguir intentando?

source: O CEO está muito feliz!
es: El CEO está muy feliz!

source: Aconteceu algum problema
es: ¿Pasó algo?

source: Acusação de DDoS
es: Acusación DDoS

source: Recebemos uma mensagem
es: Recibimos un mensaje

source: Biblioteca time
es: Biblioteca del tiempo

source: Hora atual em segundos time.clock()
es: Tiempo actual en segundos time.clock ()

source: Estou no horário de verão? time.daylight()
es: Estoy en horario de verano? time.daylight ()

source: Dormir alguns segundos time.sleep(secs)
es: Duerme unos segundos time.sleep (secs)

source: Fuso horário time.timezone()
es: Time.timezone ()

source: 10 minutos entre cada acesso
es: 10 minutos entre cada acceso

source: Resumo
es: Resumen

source: Acessamos os caracteres individuais pelo índice, que começa com zero
es: Accedemos a los caracteres individuales por índice, que comienza con cero.

source: Métodos são funções embutidas nas variáveis
es: Los métodos son funciones incorporadas en variables.

source: Existem bibliotecas de programação com código pronto
es: Hay bibliotecas de programación ya hechas.

source: Os dados possuem um tipo, como int ou string
es: Los datos tienen un tipo, como int o string.

source: Ferramentas Python
es: Herramientas de Python

source: texto[4] acessa o 5º caracter
es: texto [4] accede al quinto carácter

source: texto[4:9] acessa do 5º ao 9º caracter
es: El texto [4: 9] accede del quinto al noveno carácter.

source: O método texto.find() procura um substring
es: El método text.find () busca una subcadena

source: float() converte algo para ponto flutuante
es: float () convierte algo a punto flotante

source: Bibliotecas: urllib.request e time
es: Bibliotecas: urllib.request y tiempo
