Repository: IronVenom/PyZombis
Catalog: locale/*/LC_MESSAGES/TWP30.po
Languages: es

source: Revisão Geral 1
es: Revisión general 1

source: Acabamos o primeiro livro
es: Terminamos el primer libro.

source: Vamos começar o segundo
es: Vamos a empezar el segundo

source: O que aprendemos
es: Que aprendemos

source: Variáveis e entrada de dados
es: Variables y entrada de datos.

source: Condições
es: Condiciones

source: Repetições
es: Repeticiones

source: Strings
es: Cuerdas

source: Funções
es: Funciones

source: Arquivos
es: Archivos

source: Dicionários
es: Los diccionarios

source: Classes e Objetos
es: Clases y objetos

source: Agora só faltam seus exercícios
es: Ahora todo lo que necesitas son tus ejercicios.

source: “A vida é como andar de bicicleta. Para manter o equilíbrio, é preciso se manter em movimento”. - Einstein.
es: La vida es como andar en bicicleta. Para mantener el equilibrio, debes estarSigue moviéndote. - Einstein.

source: O que vamos aprender no segundo?
es: ¿Qué aprenderemos en el segundo?

source: As mesmas coisas!
es: Las mismas cosas

source: Fazendo jogos
es: Haciendo juegos

source: Acessando sites para ver a cotação do café
es: Accediendo a sitios web para ver la cotización del café.

source: Tratando exceções
es: Tratamiento de excepciones

source: Usando banco de dados de surfistas
es: Usando la base de datos de surfistas

source: Mixando músicas
es: Mezclando canciones

source: Encontrando seu caminho
es: Encontrando tu camino

source: Se você só usar o software dos outros, sempre estará limitado àquilo que outras pessoas acham que você deseja fazer
es: Si solo usas el software de otros, siempre estarás limitado a quéotras personas piensan que quieres hacer

source: Escreva seus próprios programas
es: Escribe tus propios programas

source: Você deseja ser programado ou ser o programador?
es: ¿Quieres ser programado o ser el programador?

source: Você pode assumir o controle
es: Puedes tomar el control

source: Adivinhando números
es: Adivinando números

source: **print()** é uma função
es: ** print () ** es una función

source: **'Bem vindo!'** é uma string
es: ** '¡Bienvenido!' ** es una cuerda

source: **g,chute** são variáveis
es: ** g, kick ** son variables

source: **if,else** são diretivas
es: ** si, si no ** son directivas

source: A lacuna que é fornecida após os dois pontos (:) da instrução if, a partir da qual a instrução print é iniciada, é chamada de recuo
es: El espacio que se proporciona después de los dos puntos (:) de la instrucción if, una partir de la cual se inicia la declaración de impresión, se denomina sangría

source: **=** é o operador de atribuição e é usado para atribuir valores a variáveis
es: ** = ** es el operador de asignación y se utiliza para asignar valores avariables

source: **==** é o operador de comparação e é usado para comparar duas variáveis ​​ou valores
es: ** == ** es el operador de comparación y se utiliza para comparar dos variablesO valores

source: As partes do seu programa
es: Las partes de tu programa.

source: :purple:`Funções` embutidas (built in functions) são chamadas pelo seu nome e exigem parênteses
es: :purple:`Functions` son llamadas por tuNombre y requerimiento de paréntesis

source: :green:`Strings` se diferenciam dos comandos do programa por estarem dentro de aspas
es: : green:`Strings` difieren de los comandos del programa porque son entre comillas

source: :red:`Variáveis` controlam dados na memória e possuem tipos diferentes
es: :red:`Variables` controlan datos en memoria y tienen diferentes tipos

source: :yellow:`Diretivas` são comandos da linguagem
es: :yellow:`directivas` son comandos de lenguaje

source: A :red:`identação` separa blocos de comandos
es: A: red:`indentation` separa los bloques de comando

source: “Cada um no seu quadrado”
es: Cada uno en su plaza

source: Um igual (=) significa atribuição
es: Un igual (=) significa asignación

source: Ex.: chute = int(g) (chute recebe inteiro de g)
es: Ej.: kick = int (g) (el kick recibe el entero de g)

source: Dois iguais (==) significa comparação
es: Dos iguales (==) significa comparación

source: Ex.: chute == 42 (chute é igual a 42?)
es: Ej .: kick == 42 (kick es igual a 42?)

source: Dois pontos abrem blocos de instruções
es: Dos puntos de bloques de instrucciones abiertos.

source: Coloque no banheiro, caderno, geladeira:
es: Poner en el baño, cuaderno, nevera:

source: “Eu amo dois pontos!”
es: ¡Me encanta el colon!

source: Quais os tipos de erro?
es: ¿Qué tipos de errores?

source: Erros de sintaxe
es: Errores de sintaxis

source: Uma linguagem de programação é formal, diferente das linguagens naturais possui sintaxe rígida
es: Un lenguaje de programación es formal, diferente de los lenguajes naturalestiene sintaxis rígida

source: Erros em tempo de execução
es: Errores en tiempo de ejecución

source: Erros semânticos (mais difíceis de achar)
es: Errores semánticos (más difíciles de encontrar)

source: Como achar e tratar erros?
es: ¿Cómo encontrar y manejar errores?

source: Sintáticos: muita atenção e prática
es: Sintáctica: mucha atención y práctica.

source: Em tempo de execução: tratamento de exceções
es: En tiempo de ejecución: manejo de excepciones

source: Semânticos: teste de mesa ou simulação
es: Semántica: prueba de mesa o simulación.

source: Então, como você executa seu código?
es: Entonces, ¿cómo ejecutar su código?

source: Há duas coisas para executar o programa de adivinhação: um editor e um interpretador
es: Hay dos cosas para ejecutar el programa de adivinanzas: un editor y unintérprete

source: O editor salva o código escrito em um arquivo no disco
es: El editor guarda el código escrito en un archivo en el disco.

source: Computadores não podem processar textos pois somente entendem binário (zeros e uns)
es: Las computadoras no pueden procesar texto porque solo entienden binario(ceros y unos)

source: O interpretador transforma o código fonte em um arquivo binário para o computador
es: El intérprete transforma el código fuente en un archivo binario para elcomputadora

source: O interpretador Python atua em dois modos: interativo e edição
es: El intérprete de Python actúa en dos modos: interactivo y edición

source: O modo interativo é ótimo para testar comandos e obter respostas instantâneas
es: El modo interactivo es ideal para probar comandos y obtener respuestasinstantáneo

source: Porém o modo edição é o mais utilizado para desenvolver os programas
es: Sin embargo, el modo de edición es el más utilizado para desarrollar los programas.

source: Nomes dos arquivos geralmente terminam com “.py”
es: Los nombres de archivos usualmente terminan con .py

source: Caso utilize outra extensão perderá as cores...
es: Si usas otra extensión perderás los colores ...

source: Um programa é mais que uma lista de comandos
es: Un programa es más que una lista de comandos.

source: O programa é uma rede viária
es: El programa es una red de carreteras.

source: Na rede você escolhe seu caminho
es: En la red eliges tu camino.

source: Dando dicas
es: Dando consejos

source: O programa somente diz se acertou ou não
es: El programa solo te dice si lo entendiste bien o no.

source: Para ajudar você dirá “Alto” ou “Baixo” caso a pessoa erre
es: Para ayudarlo, dirá “Alto” ​​o “Bajo” si la persona falla

source: Como ficaria a estrada?
es: ¿Cómo se vería el camino?

source: Utilize BACKSPACE e TAB para ir e voltar
es: Utilice RETROCESO y TAB para ir y venir

source: Os usuários ainda não gostam
es: A los usuarios todavía no les gusta.

source: Sortear o número a ser adivinhado
es: Dibuja el número para ser adivinado

source: Agora sim!
es: ¡Ahora si!

source: Resumo
es: Resumen

source: Você criou um game!
es: ¡Has creado un juego!

source: Comandos fazem coisas
es: Los comandos hacen cosas

source: Desvios decidem coisas
es: Las desviaciones deciden las cosas.

source: Laços repetem coisas
es: Los lazos repiten cosas

source: As condições ajudam você a decidir se algo é True ou False
es: Las condiciones te ayudan a decidir si algo es verdadero o falso

source: A atribuição define um nome para um dado
es: La asignación define un nombre para un determinado

source: Ferramentas do Python
es: Herramientas de Python

source: Desvios :yellow:`if/else`
es: Desvíos:yellow:`if/else`

source: Laços :yellow:`while`
es: Corbatas:yellow:`while`

source: Operador de atribuição =
es: Operador de Asignación =

source: Operador de igualdade ==
es: Operador de Igualdad ==

source: Exibir uma mensagem :purple:`print`
es: Mostrar un mensaje:purple:`print`

source: Ler a entrada :purple:`input`
es: Leer entrada :purple:`input`

source: Converter para inteiro :purple:`int`
es: Convertir a entero :purple:`int`

source: Sortear um número inteiro randint
es: Renderizar un entero randint

source: Lista VI com testes!
es: Lista VI con pruebas!
