Repository: IronVenom/PyZombis
Catalog: locale/*/LC_MESSAGES/TWP38.po
Languages: es

source: Revisão Geral 2
es: Revisión general 2

source: O que é um programa?
es: ¿Qué es un programa?

source: Um conjunto detalhado de instruções, passo a passo, dizendo o que o computador fará
es: Un conjunto detallado de instrucciones, paso a paso, que le indica quéla computadora hará

source: Se mudamos o programa, o computador fará uma outra coisa diferente
es: Si cambiamos el programa, la computadora hará algo diferente.

source: O computador permanece o mesmo, mas o programa mudou
es: La computadora sigue siendo la misma, pero el programa ha cambiado.

source: Programas são executados
es: Los programas son ejecutados

source: Software (programas) comandam o hardware
es: El software (programas) impulsa el hardware.

source: O processo de criar software chama-se programação
es: El proceso de creación de software se denomina programación.

source: Um algoritmo é a receita, passo a passo, que resolve um problema computacional
es: Un algoritmo es la receta, paso a paso, que resuelve un problemacomputacional

source: Linguagens de Programação
es: Lenguajes de programación

source: Linguagens de baixo nível são as mais próximas da máquina
es: Los lenguajes de bajo nivel son los más cercanos a la máquina

source: Carregue o número da variável A na CPU
es: Cargar el número de variable A en la CPU

source: Carregue o número da variável B na CPU
es: Cargue el número de la variable B en la CPU

source: Adicione os dois números na CPU
es: Agrega ambos números a la CPU

source: Armazene o resultado na variável C
es: Almacenar el resultado en la variable C

source: Comando original em linguagem de alto nível: C = A + B
es: Comando original en lenguaje de alto nivel: C = A + B

source: Compiladores convertem a linguagem de alto nível para a linguagem de máquina específica de um computador
es: Los compiladores convierten el lenguaje de alto nivel aMáquina específica para una computadora

source: Interpretadores analisam e executam o programa instrução por instrução na linguagem de máquina
es: Los intérpretes analizan y ejecutan el programa de instrucción por instrucción enlenguaje de máquina

source: O sinal “>>>” indica que o Python está “pronto” para receber comandos
es: El signo >>> indica que Python está listo para recibir comandos.

source: Normalmente queremos repetir uma série de comandos várias vezes
es: Normalmente queremos repetir una serie de comandos varias veces.

source: Uma forma de fazer isso é utilizar uma função
es: Una forma de hacer esto es usar una función

source: Não esqueça dos parênteses ao chamar a função!
es: ¡No olvides los paréntesis al llamar a la función!

source: Se você esquecer dos parênteses, o python devolverá o endereço na memória onde está o código da função
es: Si olvida los paréntesis, python devolverá la dirección en la memoriadonde esta el codigo de funcion

source: Podemos colocar parâmetros numa função
es: Podemos poner parámetros en una función.

source: As funções deixam de existir assim que você sair do interpretador Python
es: Las funciones dejan de existir tan pronto como sale del intérprete de Python.

source: Por isso, os programas são normalmente compostos de módulos, que são arquivos salvos em disco
es: Por lo tanto, los programas suelen estar formados por módulos, que sonarchivos guardados en el disco

source: Um módulo é um arquivo texto que contêm um programa python
es: Un módulo es un archivo de texto que contiene un programa python.

source: Você pode editar os módulos em uma ambiente de desenvolvimento, que realça palavras reservadas, faz identação automática, etc...
es: Puede editar los módulos en un entorno de desarrollo, queresaltar palabras reservadas, auto-sangría, etc ...

source: Salvamos um programa chamado caos.py
es: Guardamos un programa llamado caos.py.

source: Não esqueça a extenção .py
es: No olvides la extensión .py

source: Podemos rodar o programa com a tecla F5
es: Puedes ejecutar el programa con la tecla F5.

source: Linhas que começam com “#” são chamadas de comentários
es: Las líneas que comienzan con "#" se llaman comentarios

source: Servem para serem lidas por humanos e são ignoradas pelo Python
es: Están destinados a ser leídos por humanos y Python los ignora.

source: O Python pula todo o texto do “#” até o fim da linha
es: Python omite todo el texto desde "#" hasta el final de la línea.

source: x é um exemplo de variável
es: x es un ejemplo de una variable

source: Em x atribuiremos um valor que poderá ser referenciado depois
es: En x le asignaremos un valor que puede ser referenciado más adelante.

source: A mensagem entre aspas será apresentada e a resposta armazenada em x
es: El mensaje citado se mostrará y la respuesta se almacenará en x

source: Existem comandos de loop como o for
es: Hay comandos de bucle como para

source: Um loop serve para repetir várias vezes um bloco de comandos
es: Un bucle se usa para repetir varias veces un bloque de comandos.

source: Neste exemplo o bloco seguinte irá ser repetido 10 vezes
es: En este ejemplo el siguiente bloque se repetirá 10 veces.

source: Chamamos de identação os espaços no início da linha
es: Llamamos a los espacios al comienzo de la línea de sangría.

source: No Python a identação delimita o bloco que será executado
es: En Python, la sangría delimita el bloque que se ejecutará

source: O cálculo 3.9*x*(1-x) será executado na CPU e atribuído na variável x
es: El cálculo 3.9 * x * (1-x) se ejecutará en la CPU y se asignará en la variable x

source: A função caos devolve valores bem diferentes, mesmo quando a entrada é parecida
es: La función caos devuelve valores bastante diferentes, incluso cuando la entrada essimilar

source: Exercício
es: Ejercicio

source: Altere o programa anterior de forma que leia um valor inteiro n e execute o for n vezes no lugar do valor fixo 10
es: Cambie el programa anterior para que lea un valor entero n y ejecuteo es n veces en lugar de un valor fijo de 10

source: Resumo
es: Resumen

source: A descrição de uma seqüência de passos para resolver um problema computacional é chamada de algoritmo
es: Describiendo una secuencia de pasos para resolver un problemacomputacional se llama algoritmo

source: Algoritmos são programas (software) que determinam o que o computador (hardware) fará
es: Los algoritmos son programas (software) que determinan lo que la computadora(hardware) hará

source: O processo de criar software é chamado de programação
es: El proceso de creación de software se denomina programación.

source: Recordação
es: Recuerdo

source: Linguagens de programação possuem uma sintaxe formal
es: Los lenguajes de programación tienen una sintaxis formal.

source: Computadores entendem apenas a linguagem de máquina
es: Las computadoras solo entienden el lenguaje de la máquina

source: Python é uma linguagem interpretada de alto nível
es: Python es un lenguaje interpretado de alto nivel.

source: O interpretador Python converte os comandos instrução por instrução para a linguagem de máquina
es: El intérprete de Python convierte los comandos de instrucción por instrucción ael lenguaje de la máquina
