Repository: IronVenom/PyZombis
Catalog: locale/*/LC_MESSAGES/TWP37.po
Languages: es

source: Revisão Listas
es: Listas de Revisión

source: Campeonato de Surf em Codeville
es: Campeonato de surf en Codeville

source: Encontre a pontuação mais alta
es: Encuentra la puntuación más alta

source: Selecione a pontuação mais alta para saber o vencedor!
es: Las puntuaciones están en el archivo surf.txt.

source: Lendo o arquivo surf.txt
es: Leyendo el archivo surf.txt

source: Fragmentador for
es: Trituradora para

source: Descubra quem obteve a maior nota
es: Averigua quién obtuvo el grado más alto.

source: O método split corta a string
es: El método de división corta la cadena

source: Encontrando o 1º lugar
es: Encontrando el 1er lugar

source: Sai o placar...
es: Obtener la puntuación ...

source: Controlar 3 pontuações é complicado
es: El seguimiento de 3 puntuaciones es complicado

source: Ordenar a lista seria melhor
es: Ordenar la lista sería mejor

source: Ordenação é mais fácil na memória
es: La clasificación es más fácil en la memoria

source: Dados em disco são persistentes: se você puxar o fio da tomada, o computador não esquecerá as informações gravadas no disco
es: Los datos del disco son persistentes: si tira del cable desde el zócalo, elLa computadora no olvidará la información escrita en el disco

source: Dados na memória são muito mais rápidos, porém não são persistentes: os dados na memória desaparecem quando seu programa sai ou quando o computador é desligado
es: Los datos en la memoria son mucho más rápidos, pero no persistentes: elLos datos en la memoria desaparecen cuando su programa sale o cuandola computadora está apagada

source: Design Tradeoff: persistência x rapidez
es: Diseño de tradeoff: persistencia x velocidad.

source: Primeiro: ler os dados para a memória
es: Primero: leer datos a la memoria

source: Uai, vamô usar um trem de dados
es: Wow, voy a utilizar un tren de datos.

source: Array, lista, vetor são nomes comuns para um lote inteiro de dados
es: Array, list, vector son nombres comunes para un lote completo de datos

source: Preciso de apenas uma única variável para todo o trem de dados
es: Necesito una sola variable para todo el tren de datos

source: Voltando ao surf...
es: Volviendo al surf ...

source: Podemos criar uma lista de notas
es: Podemos crear una lista de notas.

source: Para inserir cada nova nota use append
es: Para insertar cada nueva nota use adjuntar

source: Os melhores colocados serão notas[0], notas[1] e notas[2]
es: Los mejores puestos serán los grados [0], los grados [1] y los grados [2]

source: Nova classificação
es: Nueva clasificacion

source: Classificar em ordem descrescente
es: Ordenar en orden descendente

source: Métodos sort e reverse
es: Clasificar y revertir métodos.

source: O método sort ordena os dados
es: El método de clasificación ordena los datos

source: Utilizo reverse para que fiquem em ordem descrescente
es: Uso el reverso para que estén en orden descendente.

source: O nerd pode utilizar notas.sort(reverse = True)
es: El nerd puede usar notes.sort (reverse = True)

source: Finalmente a classificação correta
es: Finalmente la calificación correcta.
