Repository: IronVenom/PyZombis
Catalog: locale/*/LC_MESSAGES/TWP47.po
Languages: es

source: Programação Modular
es: Programación modular

source: Arquivo transações.txt
es: Transacción archivo.txt

source: Venda Salgados
es: Venta de salados

source: Problemas: o banco rejeitou todo o arquivo de transações do período da manhã!
es: Problemas: el banco rechazó el archivo de transacciones completo por un período demañana!

source: Todos os cartões estavam inválidos
es: Todas las cartas eran inválidas

source: Os preços estavam altos demais: rosquinha vendida por R$ 50.791,42!
es: Los precios eran demasiado altos: ¡las donas se vendieron por $ 50,791.42!

source: Nos outros períodos não houve problema. O que será que aconteceu?
es: En los otros periodos no hubo problema. Que paso

source: O banco mudou a ordem dos dados! [Preço / Cartão / Item]
es: El banco ha cambiado el orden de los datos! [Precio / Tarjeta / Artículo]

source: Venda Salgados Tarde/Noite
es: Venta salada tarde / noche

source: Formatação corrigida por aluno!
es: Formato corregido por el alumno!

source: Venda Salgados Manhã
es: Venta Salgados Mañana

source: Produtos alterados, mas esqueceram a formatação!
es: Los productos cambiaron, pero se olvidó el formato!

source: Obs.: deixar no mesmo diretório dos programas manhã e tarde/noite
es: Nota: dejar en el mismo directorio que los programas de mañana y tarde / noche.

source: Novo programa da manhã
es: Nuevo show matutino

source: Novo programa tarde/noite
es: Nuevo programa de tarde / noche

source: Descontos
es: Descuentos

source: Agora sob nova direção os salgados na FATEC terão 10% de desconto!
es: ¡Ahora bajo una nueva dirección, el salado en FATEC tendrá un 10% de descuento!

source: Para isso será criado um módulo fatec.py
es: Esto creará un módulo fatec.py

source: Inicialmente o desconto será de 10% para todos os salgados
es: Inicialmente el descuento será del 10% para todos los salados.

source: Teremos um desconto adicional de 50% para pastéis por conta da colônia japonesa
es: Tendremos un descuento adicional del 50% para pasteles a cuenta de la coloniajaponés

source: Novo módulo japa.py
es: Nuevo módulo japa.py

source: Os nomes são iguais! E agora?
es: ¡Los nombres son los mismos! ¿Y ahora?

source: Nomes Completos
es: Nombres completos

source: A solução é adotar os nomes completos
es: La solución es adoptar los nombres completos.

source: dis Module
es: módulo dis
