Repository: IronVenom/PyZombis
Catalog: locale/*/LC_MESSAGES/TWP40.po
Languages: es

source: Revisão Geral 3
es: Revisión general 3

source: O processo de desenvolvimento de software
es: El proceso de desarrollo de software

source: Executar programas feitos por outros é uma tarefa relativamente simples
es: Ejecutar programas hechos por otros es una tarea relativamente simple.

source: O difícil é começar a criar seus próprios programas
es: La parte difícil es comenzar a crear tus propios programas.

source: Computadores são muito rigorosos e há muitos detalhes
es: Las computadoras son muy estrictas y hay muchos detalles.

source: Por isso é necessário ser muito sistemático
es: Por eso es necesario ser muy sistemático.

source: Etapas no processo de desenvolvimento de software
es: Pasos en el proceso de desarrollo de software.

source: Analisar o problema:
es: Analiza el problema:

source: Entender exatamente qual é o problema a ser resolvido
es: Entender exactamente qué problema resolver

source: Problema bem definido, meio problema resolvido
es: Problema bien definido, medio problema resuelto

source: Especificar o problema:
es: Especifique el problema:

source: Descrever exatamente o que o seu programa fará
es: Describe exactamente lo que hará tu programa

source: Nesta etapa não me devo preocupar em como irei fazer meu programa,
es: En esta etapa no debería preocuparme por cómo haré mi programa,

source: mas em decidir exatamente o que ele fará
es: pero al decidir exactamente lo que hará

source: Quais são as entradas e saídas do programa?
es: ¿Cuáles son las entradas y salidas del programa?

source: Projetar o programa:
es: Diseña el programa:

source: Formular a estrutura geral do programa
es: Formular la estructura general del programa.

source: Podemos usar pseudo-código nesta etapa
es: Podemos usar pseudocódigo en este paso

source: Implementar o programa:
es: Implementar el programa:

source: Elaborar alguns testes para validar o seu programa
es: Desarrolla algunas pruebas para validar tu programa.

source: Traduzir o projeto em alguma linguagem
es: Traducir el proyecto a algún idioma.

source: Neste curso utilizaremos Python
es: En este curso utilizaremos Python.

source: Exemplo: conversor de temperatura de Fahrenheit para Celsius
es: Ejemplo: convertidor de temperatura Fahrenheit a Celsius

source: Análise: dada uma temperatura em graus Fahrenheit obter a conversão para Celsius
es: Análisis: dada una temperatura en grados Fahrenheit, obtener la conversión aCelsius

source: Especificação do que o programa fará:
es: Especificación de lo que hará el programa:

source: Entrada: temperatura em Fahrenheit
es: Check in: temperatura Fahrenheit

source: Saída: temperatura em Celsius
es: Salida: temperatura Celsius

source: Saída: 5*(F-32)/9
es: Salida: 5 * (F-32) / 9

source: Projeto do como o programa fará:
es: Proyecto de cómo se realizará el programa:

source: Leia o valor da temperatura em Fahrenheit
es: Leer el valor de la temperatura en Fahrenheit

source: Converta o valor usando a fórmula 5*(F-32)/9
es: Convierta el valor usando la fórmula 5 * (F-32) / 9

source: Imprima o valor convertido
es: Imprima el valor convertido

source: Implementação:
es: Implementación:

source: Testes: 32 f = 0 c e 100 f = 37.8 c
es: Pruebas: 32 f = 0 c y 100 f = 37.8 c

source: Uso de variáveis com valores definidos
es: Uso de variables con valores definidos

source: Variáveis com valores indefinidos
es: Variables con valores indefinidos.

source: Caracter de final de linha
es: Carácter de fin de línea

source: Atribuição de variáveis
es: Asignación de variables

source: <variável> = <expressão>
es: <variable> = <expresión>

source: A <expressão> calculada no processador modifica a memória referenciada por <variável>
es: Procesador calculado <expresión> modifica la memoria de referenciapor <variable>

source: Leitura e atribuição
es: Lectura y asignacion

source: Atribuição múltipla
es: Asignación múltiple

source: for <var> in <seqüência>
es: for <var> in <consecuencia>

source: Exercício
es: Ejercicio

source: Nós queremos desenvolver um programa que determine o valor futuro de um investimento, dados o valor inicial e a taxa de juros
es: Queremos desarrollar un programa que determine el valor futuro de unInversión, dado valor inicial y tasa de interés

source: Análise:
es: Análisis:

source: Dinheiro inicial rende uma taxa de juros anual
es: El efectivo inicial produce una tasa de interés anual.

source: Quanto ele irá valer em 10 anos?
es: ¿Cuánto valdrá en 10 años?

source: Entrada: valor inicial, taxa de juros
es: Entrada: valor inicial, tasa de interés

source: Saída: valor em 10 anos
es: Salida: valor en 10 años.

source: Especificação:
es: Especificación

source: Usuário entra com o valor inicial investido
es: El usuario ingresa el monto inicial invertido

source: Usuário entra com a taxa de juros anual
es: El usuario ingresa con la tasa de interés anual.

source: Fórmula de matemática financeira valor*(1+juros)
es: Fórmula financiera de Matemáticas de valor * (1 + Interés)

source: Projeto:
es: Proyecto:

source: Entre com o valor do investimento inicial
es: Ingrese el valor de inversión inicial

source: Entre com a taxa de juros
es: Introduce la tasa de interés

source: Repita 10 vezes:
es: Repita 10 veces:

source: valor inicial = valor inicial * (1 + taxa de juros)
es: valor inicial = valor inicial * (1 + tasa de interés)

source: –Imprima o valor atualizado
es: -Presione el valor actualizado.

source: –Valores de teste:
es: –Valores de prueba:

source: 1000 reais e 3% de juros
es: 1000 reales y 3% de interes

source: 1000 reais e 10% de juros
es: 1000 reales y 10% de interés.

source: Perguntas
es: Inicio

source: Por que definir alguns testes antes da implementação é uma boa prática de programação?
es: Por qué establecer algunas pruebas antes de la implementación es una buena prácticaprogramación?

source: Qual é a vantagem de escrever um pseudo-código na etapa de projeto?
es: ¿Cuál es el beneficio de escribir un pseudo código en la etapa de diseño?

source: Números básicos
es: Números basicos

source: Tabela de operadores
es: Mesa de operadores

source: **Tabela de operadores**
es: **Mesa de operadores**

source: Operação
es: Operación

source: Multiplicação
es: Multiplicación

source: Divisão
es: División

source: Exponenciação
es: Exposiciónción

source: Resto da divisão
es: Resto de la división

source: Divisão inteira
es: División entera

source: Subtração
es: Resta

source: Adição
es: Añadiendo

source: Divisão inteira em linguagens antigas
es: Toda la división en lenguas antiguas.

source: As linguagens mais antigas geram um resultado inteiro na divisão de inteiros!
es: Los lenguajes más antiguos generan un resultado entero en la división de¡Todo!

source: No cálculo de fahrenheit para celsius terei que modificar um pouco meu programa se usar C ou Java
es: Cuando calculo fahrenheit para centígrados tendré que modificar un poco miPrograma si usar C o Java

source: Conversão de graus em C
es: Grados a la conversión de C
