Repository: IronVenom/PyZombis
Catalog: locale/*/LC_MESSAGES/TWP45.po
Languages: es

source: Hackeando o Facebook com Python
es: Hackeando Facebook con Python

source: Hackers não são “do mal” ?
es: Los hackers no son malvados?

source: Links autenticados
es: Enlaces autenticados

source: Obs.: access_token expira
es: Nota: access_token expira

source: Autenticar novamente neste caso
es: Volver a autenticarse en este caso

source: Android Wallpaper
es: Fondo de pantalla de Android

source: Sabe o que é ter vontade de acordar cedo no domingo para estudar?!?
es: ¿Sabes lo que se siente al levantarte temprano el domingo para estudiar?

source: Bom, eu também não sei explicar, mas é o que estou sentindo no momento .-.
es: Bueno, no sé cómo explicarlo, pero eso es lo que estoy sintiendo en este momento.

source: Bora Casdinho!
es: ¡Vamos a casdinho!

source: Hackear participantes a partir do evento criado no Facebook
es: Hackea a los participantes del evento creado en Facebook.

source: Inserir link para o perfil pessoal no Facebook
es: Insertar enlace a perfil personal en Facebook
