Repository: IronVenom/PyZombis
Catalog: locale/*/LC_MESSAGES/TWP42.po
Languages: es

source: Banco de Dados
es: Banco de datos

source: A Federação de Surf possui os seguintes dados: número do surfista, nome, país, nota média, estilo, idade.
es: La Federación de Surf tiene los siguientes datos: número de surfista, nombre,País, nota media, estilo, edad

source: Como usar estes dados?
es: ¿Cómo utilizar estos datos?

source: Por exemplo, quero saber todos os surfistas com mais de 25 anos
es: Por ejemplo, quiero conocer a todos los surfistas mayores de 25 años.

source: Usando um Banco de Dados! No caso o sqlite3
es: Usando una base de datos! En el caso sqlite3.

source: Obs.: copie surfersDB.sdb para o seu diretório
es: Nota: copie surfersDB.sdb en su directorio

source: Obs.: não salve seu programa com o nome sqlite3.py (mesmo nome da lib)
es: Nota: no guarde su programa como sqlite3.py (mismo nombre que lib)

source: Noções de SQL
es: Entendiendo SQL

source: Noções de Banco de Dados
es: Nociones de base de datos

source: Criando um Banco de Alunos
es: Creación de un banco de estudiantes

source: Acessando o banco alunos.bd
es: Accediendo al banco estudiantes.bd
