Repository: IronVenom/PyZombis
Catalog: locale/*/LC_MESSAGES/TWP54.po
Languages: es

source: Exceções
es: Excepciones

source: Algumas vezes as coisas dão errado. E você precisa tratá-las.
es: A veces las cosas salen mal. Y hay que tratarlos.

source: Sempre existem coisas que fogem do seu controle. Redes falham. Arquivos desaparecem.
es: Siempre hay cosas que están fuera de tu control.desaparecer

source: Códigos inteligentes aprendem a tratar estes erros e fazem com que o programa se recupere suavemente.
es: Los códigos inteligentes aprenden cómo manejar estos errores y hacer queEl programa se recupera sin problemas

source: Que fedor!!
es: ¡Qué hedor!

source: Exceção é lançada
es: Se lanza la excepción.

source: Capturando a exceção
es: Atrapando la excepción

source: Tratando exceções
es: Tratamiento de excepciones

source: Obs.: para você testar a exceção deverá alterar as propriedades do arquivo
es: Nota: para que pruebe la excepción, debe cambiar las propiedades del archivo.

source: Tratando Exceções
es: Manejo de excepciones

source: Usando uma messagebox
es: Usando un buzón de mensajes
