Repository: IronVenom/PyZombis
Catalog: locale/*/LC_MESSAGES/TWP58.po
Languages: es

source: DJ Mix 2 Revisão Orientação à Objetos
es: DJ Mix 2 Object Oriented Review

source: POO – Programação Orientada à Objetos
es: OOP - Programación Orientada a Objetos

source: Temos DJ Mix para uma música
es: Tenemos DJ Mix para una canción.

source: Agora precisamos para várias
es: Ahora necesitamos varios

source: Não duplicaremos código!
es: ¡No duplicaremos el código!

source: Programação Orientada à Objetos
es: Programación Orientada a Objetos

source: Classe = fábrica de objetos
es: Clase = fábrica de objetos

source: Parabéns! Agora você sabe criar programas complexos com pouco código
es: Enhorabuena Ahora sabes cómo crear programas complejos con poco código.

source: Recordação
es: Recuerdo

source: Classes são fábricas de objetos
es: Las clases son fábricas de objetos.

source: Classe = métodos + dados
es: Clase = métodos + datos

source: Criar objetos = instanciar uma classe
es: Crear objetos = instanciar una clase

source: class – inicia a definição de uma classe
es: clase - comienza a definir una clase

source: self – atribuído ao objeto corrente
es: autoasignado al objeto actual

source: __init__() método chamado na criação do objeto
es: __init __ () método llamado en la creación de objetos
