Repository: IronVenom/PyZombis
Catalog: locale/*/LC_MESSAGES/TWP50.po
Languages: es

source: Interface Gráfica
es: Interfaz grafica

source: Não basta funcionar, deve ser bonito também
es: No es suficiente trabajar, debe ser hermoso también.

source: Interface texto funciona, mas é pobre
es: La interfaz de texto funciona pero es pobre

source: Show de Calouros
es: Estudiante de primer año

source: Opção 1 para resposta correta e 2 para errada
es: Opción 1 para la respuesta correcta y 2 para la respuesta incorrecta

source: Teremos um efeito sonoro para cada resposta
es: Tendremos un efecto de sonido para cada respuesta.

source: O programa deve contar quantas respostas certas e erradas houve
es: El programa debe contar cuántas respuestas correctas e incorrectas.

source: Finalmente apertamos 0 para finalizar
es: Finalmente presiona 0 para terminar

source: +Atenção: instalar Pygame e baixar os arquivos de áudio para continuar a lição
es: + Advertencia: instala Pygame y descarga los archivos de audio para continuarlección

source: Agora que o áudio está funcionando vamos fazer o programa do Show de Calouros!
es: Ahora que el audio está funcionando, hagamos el programa Show deEstudiantes de primer año!

source: Janela básica
es: Ventana basica

source: Capturando um evento
es: Capturando un evento

source: Adicionando Label´s
es: Añadiendo etiquetas

source: Revisão
es: Revisión

source: Usando biblioteca de terceiros: pygame
es: Utilizando biblioteca de terceros: pygame

source: Loop de evento: responde apenas quando o evento ocorre
es: Ciclo de eventos: responde solo cuando ocurre un evento

source: Tratador do evento: rotina que é executada quando o evento ocorre
es: Controlador de eventos: rutina que se ejecuta cuando se produce el evento

source: pass – código python para não fazer nada
es: pase - codigo python para no hacer nada

source: Tkinter: biblioteca para interface gráfica
es: Tkinter: biblioteca para la interfaz gráfica
