Repository: IronVenom/PyZombis
Catalog: locale/*/LC_MESSAGES/TWP65.po
Languages: es

source: Desenvolvimento Web Intro
es: Introducción al desarrollo web

source: Requisições e respostas
es: Peticiones y respuestas

source: Desenvolvimento Web
es: Desarrollo web

source: “Python: a única linguagem com mais frameworks web do que keywords”
es: Python: el único idioma con más frameworks web que palabras clave.

source: Padrões de acesso e comunicação entre servidores Web e aplicações Python
es: Servidor web y aplicación de Python acceso y patrones de comunicación.

source: Não é J2EE ;-)
es: No es J2EE ;-)

source: Decorator Contador com tempo
es: Decorador de contador con tiempo.

source: InfoWorld: best full-stack Python framework
es: InfoWorld: el mejor framework Python de pila completa

source: Bossie: Best Open Source Development Software
es: Bossie: el mejor software de desarrollo de código abierto

source: Modelo: dados
es: Modelo: datos

source: Controladores: regras do negócio
es: Controladores: reglas de negocio

source: Visões: apresentação
es: Vistas: Presentación

source: Autocontido == full-stack framework
es: Autónomo == marco de pila completa

source: Seguro
es: El seguro

source: Deploy rápido e distribuição fácil
es: Implementación rápida y fácil implementación

source: Princípios Python
es: Principios de Python

source: Deve existir apenas uma única maneira óbvia de fazer algo
es: Solo debe haber una manera obvia de hacer algo.

source: Explícito é melhor que implícito (não segue)
es: Explícito es mejor que implícito (no sigue)

source: Habilitar a opção “Não usar servidor proxy para servidores locais”
es: Habilitar el servidor no usar proxy para servidores locales

source: web2py.exe no diretório descompactado
es: web2py.exe en el directorio descomprimido

source: Definir uma senha para administrador
es: Establecer una contraseña de administrador

source: Clicar em “Administrative Interface”
es: Haga clic en la interfaz administrativa

source: Coloque a senha que você definiu
es: Ingrese la contraseña que estableció

source: Três opções: admin, examples e welcome
es: Tres opciones: admin, ejemplos y bienvenidos.

source: Depois iremos aprender a utilizar appliances
es: Luego aprenderemos a usar los aparatos.

source: Nova aplicação básica: “Hello World”
es: Nueva aplicación básica: Hello World.

source: Editar o controlador default.py
es: Edite el controlador default.py

source: Voltar e clicar no Hello World
es: Atrás y haga clic en Hello World

source: Editar novamente o controlador default.py
es: Edite el controlador default.py de nuevo

source: Agora vamos editar a visão default/index
es: Ahora vamos a editar la vista por defecto / índice.

source: Apagar tudo e trocar na visão default/index
es: Eliminar todo y cambiar en la vista predeterminada / índice

source: Web2py Visão
es: Visión general de Web2py

source: Visão default/index
es: Vista / índice por defecto

source: Visitantes diferentes possuem contadores diferentes
es: Diferentes visitantes tienen diferentes contadores.

source: Duas páginas
es: Dos paginas

source: Iremos criar duas páginas
es: Crearemos dos páginas.

source: A primeira solicita o nome em um formulário
es: El primero solicita el nombre en un formulario.

source: Seremos então redirecionados para a segunda
es: Luego seremos redirigidos a la segunda.

source: A segunda irá dar uma saudação com o nome
es: El segundo saludará con el nombre.

source: Incluir no controlador default.py
es: Incluir en el controlador default.py

source: Criar a visão default/primeira
es: Crear predeterminado / primera vista

source: Qual é o seu nome?
es: ¿Cual es tu nombre?

source: <form action="segunda">
es: <form action="El lunes">

source: <input name="nome" />
es: <input name="nombre" />

source: Criar a visão default/segunda
es: Crear predeterminado / segunda vista

source: <h1>Olá {{=request.vars.nome}}</h1>
es: <h1>Hola {{=request.vars.nome}}</h1>

source: Appliances
es: Electrodomésticos

source: EcardsOnMap (é grande...)
es: EcardsOnMap (es genial ...)

source: Geradores Intro
es: Generadores de introducción
