Repository: IronVenom/PyZombis
Catalog: locale/*/LC_MESSAGES/TWP60.po
Languages: es

source: Não temos entrada com input()
es: No tenemos entrada con input()

source: Entrada pelo mouse e teclado via eventos
es: Entrada vía ratón y teclado mediante eventos.

source: Pygame usa tuplas ao invés de listas
es: Pygame usa tuplas en lugar de listas

source: Tuplas são listas imutáveis, por isso seu processamento é mais eficiente
es: Las tuplas son listas inmutables, por lo que su procesamiento es más eficiente.

source: Tuplas são listas com parentêses no lugar de colchetes
es: Las tuplas son listas con paréntesis en lugar de paréntesis

source: pygame.locals inclui constantes como QUIT ou K_ESCAPE
es: pygame.locals incluye constantes como QUIT o K_ESCAPE

source: Utilizamos sys.exit() para sair “suavemente” do programa
es: Usamos sys.exit () para salir suavemente del programa

source: Se eu não apagar o pixArray ele ficará no estado locked
es: Si no borro el pixArray estará en el estado bloqueado

source: Apago o pixArray para poder manusear o objeto Surface via método blit()
es: Borro pixArray para poder manejar el objeto Surface mediante el método blit ().

source: O blit() apenas modifica a memória, mas para atualizar a tela devo dar display.update()
es: El blit () solo modifica la memoria, pero para actualizar la pantalla debo dardisplay.update ()

source: Não esqueça de dar pygame.quit()
es: No te olvides de dar pygame.quit ()

source: Pygame Animação
es: Animación de Pygame

source: Note que nos dicionários b1, b2 e b3 tenho objetos e direções embutidos
es: Tenga en cuenta que en los diccionarios b1, b2 y b3 tengo objetos e instrucciones incrustados

source: Monto uma lista blocks com os três dicionários
es: Estoy agregando una lista de bloques con los tres diccionarios.

source: Player.png aparece na escala desejada
es: Player.png aparece en la escala deseada

source: Gero randomicamente 20 cerejas iniciais
es: Genero al azar 20 cerezas iniciales

source: Utilizo dois canais, um para a música de fundo e outro para cada cereja apanhada
es: Uso dos canales, uno para música de fondo y uno para cada cerezaatrapado

source: Tecla ‘m’ pausa o fundo musical e o click do mouse planta uma cerejinha na posição clicada
es: La tecla M 'detiene el fondo musical y el clic del ratón planta una cerezaen posición de clic

source: As cerejas são geradas aleatoriamente a cada passagem no looping principal
es: Las cerezas se generan aleatoriamente con cada pasada en el bucle principal

source: Removo cerejas “comidas”, claro engordando!
es: Quito las cerezas comidas, por supuesto engordando!

source: Todas as “blitadas” aparecem no update
es: Todas las blitas aparecen en actualización

source: Variável que controla o mainClock.tick()
es: Variable que controla el mainClock.tick ()

source: Os monstrinhos possuem um tamanho mínimo e máximo e sua velocidade é controlada
es: Los pequeños monstruos tienen un tamaño mínimo y máximo y su velocidad escontrolado
